Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ1064DAG169.PIC
      <edc:SFRDef edc:_addr="0x1F8E80F4" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="31" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD213" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD213" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80F8" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="32" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD214" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD214" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E80FC" edc:_begin="0xc0" edc:_end="0xc4" edc:_modsrc="DOS-EIP-00184_emb_ddr_controller_v1.Module" edc:_refcount="33" edc:access="------------nnnnnnnnnnnnnnnnnnnn" edc:cname="DDRCMD215" edc:desc="" edc:impl="0xfffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------00000000000000000000" edc:name="DDRCMD215" edc:nzwidth="32" edc:por="------------00000000000000000000" ltx:memberofperipheral="">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDADDRHCMD" edc:mask="0xff" edc:name="MDADDRHCMD" edc:nzwidth="8"/>
            <edc:SFRFieldDef edc:cname="BNKADDRCMD" edc:mask="0x7" edc:name="BNKADDRCMD" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="WAIT" edc:mask="0x1ff" edc:name="WAIT" edc:nzwidth="9"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E8100" edc:offset="0x1000"/>
      <edc:SFRDef edc:_addr="0x1F8E9100" edc:_begin="0x100" edc:_end="0x110" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="1" edc:access="--nn-n------------------------rr" edc:cname="DDRSCLSTART" edc:desc="" edc:impl="0xf4000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-0------------------------xx" edc:name="DDRSCLSTART" edc:nzwidth="32" edc:por="--00-0------------------------xx" ltx:baseofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCLLBPASS" edc:mask="0x1" edc:name="SCLLBPASS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCLUBPASS" edc:mask="0x1" edc:name="SCULBPASS" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="SCLEN" edc:mask="0x1" edc:name="SCLEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SCLSTART" edc:mask="0x1" edc:name="SCLSTART" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCLPHCAL" edc:mask="0x1" edc:name="SCLPHCAL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E9104" edc:_begin="0x100" edc:_end="0x110" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="1" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F8E910C" edc:_begin="0x100" edc:_end="0x110" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="DDRSCLLAT" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------00000000" edc:name="DDRSCLLAT" edc:nzwidth="32" edc:por="------------------------00000000" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAPCLKDLY" edc:mask="0xf" edc:name="CAPCLKDLY" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="DDRCLKDLY" edc:mask="0xf" edc:name="DDRCLKDLY" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E9110" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x1F8E9118" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="-------n----------------nnnn--nn" edc:cname="DDRSCLCFG0" edc:desc="" edc:impl="0x10000f3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------0----------------0000--00" edc:name="DDRSCLCFG0" edc:nzwidth="32" edc:por="-------0----------------0000--00" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="BURST8" edc:mask="0x1" edc:name="BURST8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DDR2" edc:mask="0x1" edc:name="DDR2" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RCASLAT" edc:mask="0xf" edc:name="RCASLAT" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="ODTCSW" edc:mask="0x1" edc:name="ODTCSW" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E911C" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="-------------------nnnnn-------n" edc:cname="DDRSCLCFG1" edc:desc="" edc:impl="0x1f01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------------uuuuu-------0" edc:name="DDRSCLCFG1" edc:nzwidth="32" edc:por="-------------------xxxxx-------0" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SCLCSEN" edc:mask="0x1" edc:name="SCLCSEN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="WCASLAT" edc:mask="0xf" edc:name="WCASLAT" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DBLREFDLY" edc:mask="0x1" edc:name="DBLREFDLY" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E9120" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="-nnn----nnnnnnnn-nn---nnnnnnnnnn" edc:cname="DDRPHYPADCON" edc:desc="" edc:impl="0x70ff63ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000----00000000-00---0000000000" edc:name="DDRPHYPADCON" edc:nzwidth="32" edc:por="-000----00000000-00---0000000000" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODTSEL" edc:mask="0x1" edc:name="SCLCSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODTEN" edc:mask="0x1" edc:name="SCLCSEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATDRVSEL" edc:mask="0x1" edc:name="DATDRVSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ADDCDRVSEL" edc:mask="0x1" edc:name="ADDCDRVSEL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODTPDCAL" edc:mask="0x3" edc:name="ODTPDCAL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="ODTPUCAL" edc:mask="0x3" edc:name="ODTPUCAL" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="EOENCLKCYC" edc:mask="0x1" edc:name="EOENCLKCYC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NOEXTDLL" edc:mask="0x1" edc:name="NOEXTDLL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="WRCMDDLY" edc:mask="0x1" edc:name="WRCMDDLY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HALFRATE" edc:mask="0x1" edc:name="HALFRATE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DRVSTRNFET" edc:mask="0xf" edc:name="DRVSTRNFET" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DRVSTRPFET" edc:mask="0xf" edc:name="DRVSTRPFET" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RCVREN" edc:mask="0x1" edc:name="RCVREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PREAMBDLY" edc:mask="0x3" edc:name="PREAMBDLY" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E9124" edc:_begin="0x110" edc:_end="0x184" edc:_modsrc="DOS-EIP-00213_emb_ddr_phy_v1.Module" edc:_refcount="2" edc:access="nnnn-nnnnnnnnnnnnnnnnnnn--------" edc:cname="DDRPHYDLLR" edc:desc="" edc:impl="0xf7ffff00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-0000000000000000000--------" edc:name="DDRPHYDLLR" edc:nzwidth="32" edc:por="0000-0000000000000000000--------" ltx:memberofperipheral="DDR_PHY">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="RECALIBCNT" edc:mask="0x3ffff" edc:name="RECALIBCNT" edc:nzwidth="0x12"/>
            <edc:SFRFieldDef edc:cname="DISRECALIB" edc:mask="0x1" edc:name="DISRECALIB" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="DLYSTVAL" edc:mask="0xf" edc:name="DLYSTVAL" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
