Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/edc/PIC32MZ1064DAG169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA908" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA66" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA66" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1623" edc:desc="" edc:mask="0xf" edc:name="PIXEL1623" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1622" edc:desc="" edc:mask="0xf" edc:name="PIXEL1622" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1621" edc:desc="" edc:mask="0xf" edc:name="PIXEL1621" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1620" edc:desc="" edc:mask="0xf" edc:name="PIXEL1620" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1619" edc:desc="" edc:mask="0xf" edc:name="PIXEL1619" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1618" edc:desc="" edc:mask="0xf" edc:name="PIXEL1618" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1617" edc:desc="" edc:mask="0xf" edc:name="PIXEL1617" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1616" edc:desc="" edc:mask="0xf" edc:name="PIXEL1616" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA90C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA67" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA67" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1631" edc:desc="" edc:mask="0xf" edc:name="PIXEL1631" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1630" edc:desc="" edc:mask="0xf" edc:name="PIXEL1630" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1629" edc:desc="" edc:mask="0xf" edc:name="PIXEL1629" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1628" edc:desc="" edc:mask="0xf" edc:name="PIXEL1628" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1627" edc:desc="" edc:mask="0xf" edc:name="PIXEL1627" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1626" edc:desc="" edc:mask="0xf" edc:name="PIXEL1626" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1625" edc:desc="" edc:mask="0xf" edc:name="PIXEL1625" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1624" edc:desc="" edc:mask="0xf" edc:name="PIXEL1624" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA910" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA68" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA68" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL177" edc:desc="" edc:mask="0xf" edc:name="PIXEL177" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL176" edc:desc="" edc:mask="0xf" edc:name="PIXEL176" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL175" edc:desc="" edc:mask="0xf" edc:name="PIXEL175" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL174" edc:desc="" edc:mask="0xf" edc:name="PIXEL174" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL173" edc:desc="" edc:mask="0xf" edc:name="PIXEL173" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL172" edc:desc="" edc:mask="0xf" edc:name="PIXEL172" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL171" edc:desc="" edc:mask="0xf" edc:name="PIXEL171" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL170" edc:desc="" edc:mask="0xf" edc:name="PIXEL170" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA914" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA69" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA69" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1715" edc:desc="" edc:mask="0xf" edc:name="PIXEL1715" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1714" edc:desc="" edc:mask="0xf" edc:name="PIXEL1714" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1713" edc:desc="" edc:mask="0xf" edc:name="PIXEL1713" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1712" edc:desc="" edc:mask="0xf" edc:name="PIXEL1712" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1711" edc:desc="" edc:mask="0xf" edc:name="PIXEL1711" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1710" edc:desc="" edc:mask="0xf" edc:name="PIXEL1710" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL179" edc:desc="" edc:mask="0xf" edc:name="PIXEL179" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL178" edc:desc="" edc:mask="0xf" edc:name="PIXEL178" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA918" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA70" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA70" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1723" edc:desc="" edc:mask="0xf" edc:name="PIXEL1723" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1722" edc:desc="" edc:mask="0xf" edc:name="PIXEL1722" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1721" edc:desc="" edc:mask="0xf" edc:name="PIXEL1721" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1720" edc:desc="" edc:mask="0xf" edc:name="PIXEL1720" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1719" edc:desc="" edc:mask="0xf" edc:name="PIXEL1719" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1718" edc:desc="" edc:mask="0xf" edc:name="PIXEL1718" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1717" edc:desc="" edc:mask="0xf" edc:name="PIXEL1717" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1716" edc:desc="" edc:mask="0xf" edc:name="PIXEL1716" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA91C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA71" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA71" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL1731" edc:desc="" edc:mask="0xf" edc:name="PIXEL1731" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1730" edc:desc="" edc:mask="0xf" edc:name="PIXEL1730" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1729" edc:desc="" edc:mask="0xf" edc:name="PIXEL1729" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1728" edc:desc="" edc:mask="0xf" edc:name="PIXEL1728" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1727" edc:desc="" edc:mask="0xf" edc:name="PIXEL1727" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1726" edc:desc="" edc:mask="0xf" edc:name="PIXEL1726" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1725" edc:desc="" edc:mask="0xf" edc:name="PIXEL1725" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL1724" edc:desc="" edc:mask="0xf" edc:name="PIXEL1724" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA920" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA72" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA72" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL187" edc:desc="" edc:mask="0xf" edc:name="PIXEL187" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL186" edc:desc="" edc:mask="0xf" edc:name="PIXEL186" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL185" edc:desc="" edc:mask="0xf" edc:name="PIXEL185" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL184" edc:desc="" edc:mask="0xf" edc:name="PIXEL184" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL183" edc:desc="" edc:mask="0xf" edc:name="PIXEL183" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL182" edc:desc="" edc:mask="0xf" edc:name="PIXEL182" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL181" edc:desc="" edc:mask="0xf" edc:name="PIXEL181" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL180" edc:desc="" edc:mask="0xf" edc:name="PIXEL180" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
